{
  "version": "https://jsonfeed.org/version/1",
  "title": "Title of the website. Update me.",
  "home_page_url": "https://update-me.com",
  "feed_url": "https://update-me.com/feed/feed.json",
  "description": "Description of the website. Update me.",
  "author": {
    "name": "Author Name. Update me.",
    "url": ""
  },
  "items": [{
      "id": "https://update-me.com/posts/fourthpost/",
      "url": "https://update-me.com/posts/fourthpost/",
      "title": "This is my fourth post.",
      "content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<p><img src=\"https://cdn.pixabay.com/photo/2020/08/25/11/11/zebra-5516455_1280.jpg\" alt=\"An image\"></p>\n<h2 id=\"section-header\">Section Header <a class=\"direct-link\" href=\"#section-header\">#</a></h2>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n",
      "date_published": "2018-09-30T00:00:00+00:00"
    },{
      "id": "https://update-me.com/posts/thirdpost/",
      "url": "https://update-me.com/posts/thirdpost/",
      "title": "This is my third post.",
      "content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<pre class=\"language-js\"><code class=\"language-js\"><span class=\"highlight-line\"><span class=\"token comment\">// this is a command</span></span><br><span class=\"highlight-line\"><span class=\"token keyword\">function</span> <span class=\"token function\">myCommand</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span></span><br><ins class=\"highlight-line highlight-line-add\">\t<span class=\"token keyword\">let</span> counter <span class=\"token operator\">=</span> <span class=\"token number\">0</span><span class=\"token punctuation\">;</span></ins><br><span class=\"highlight-line\"></span><br><del class=\"highlight-line highlight-line-remove\">\tcounter<span class=\"token operator\">++</span><span class=\"token punctuation\">;</span></del><br><span class=\"highlight-line\"></span><br><span class=\"highlight-line\"><span class=\"token punctuation\">}</span></span><br><span class=\"highlight-line\"></span><br><span class=\"highlight-line\"><span class=\"token comment\">// Test with a line break above this line.</span></span><br><span class=\"highlight-line\">console<span class=\"token punctuation\">.</span><span class=\"token function\">log</span><span class=\"token punctuation\">(</span><span class=\"token string\">'Test'</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span></span></code></pre>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<h2 id=\"section-header\">Section Header <a class=\"direct-link\" href=\"#section-header\">#</a></h2>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n",
      "date_published": "2018-08-24T00:00:00+00:00"
    },{
      "id": "https://update-me.com/posts/secondpost/",
      "url": "https://update-me.com/posts/secondpost/",
      "title": "This is my second post.",
      "content_html": "<p>Leverage agile frameworks to provide a robust synopsis for high level overviews. Iterative approaches to corporate strategy foster collaborative thinking to further the overall value proposition. Organically grow the holistic world view of disruptive innovation via workplace diversity and empowerment.</p>\n<h2 id=\"section-header\">Section Header <a class=\"direct-link\" href=\"#section-header\">#</a></h2>\n<p><a href=\"/posts/firstpost/\">First post</a><br>\n<a href=\"/posts/thirdpost/\">Third post</a></p>\n<p>Bring to the table win-win survival strategies to ensure proactive domination. At the end of the day, going forward, a new normal that has evolved from generation X is on the runway heading towards a streamlined cloud solution. User generated content in real-time will have multiple touchpoints for offshoring.</p>\n<p>Capitalize on low hanging fruit to identify a ballpark value added activity to beta test. Override the digital divide with additional clickthroughs from DevOps. Nanotechnology immersion along the information highway will close the loop on focusing solely on the bottom line.</p>\n",
      "date_published": "2018-07-04T00:00:00+00:00"
    },{
      "id": "https://update-me.com/posts/firstpost/",
      "url": "https://update-me.com/posts/firstpost/",
      "title": "Degree or Pedigree?",
      "content_html": "<p>This is a mail that I sent to</p>\n<p><a href=\"mailto:pro-president@xxx.edu.in\">pro-president@xxx.edu.in</a></p>\n<p><a href=\"mailto:vicechairman.axpxt@xxx.edu.in\">vicechairman.axpxt@xxx.edu.in</a></p>\n<p><a href=\"mailto:president@xxx.edu.in\">president@xxx.edu.in</a></p>\n<p><a href=\"mailto:hod.cse@xxx.edu.in\">hod.cse@xxx.edu.in</a></p>\n<p><a href=\"mailto:xxvxxn.xxxraxxxi@xxx.edu.in\">xxvxxn.xxxraxxxi@xxx.edu.in</a></p>\n<p>and none of them replied.</p>\n<p>Sir,</p>\n<p>I have been a student of JECRC University since the last 2 years. I am currently enrolled in Bachelor's of Technology in Computer Science. And after 2 years of pure dedication, I am dropping out of your university.</p>\n<p><strong>Why?</strong></p>\n<p>Because my family had high expectations from me and I had high expectations from you.</p>\n<p><strong>Where did you fall short?</strong></p>\n<p>I will guide you through my journey.</p>\n<p>On the first day of my college I was bombarded with big words like Software Development, Android Development,  Operating Systems, Web Development, Hacking, I thought after 4 years of my study I will easily be able to do any of these things.</p>\n<p>And that's the simple truth why I joined your college I did not join it for a degree, I joined it to learn these things. To be honest, I fell for your Ph. D. faculty in the beginning, I thought they know everything. In the first year of my college, I was taught subjects that were totally irrelevant to my field of study, I was taught subjects like Economics, Law, English, Physics, Chemistry, Maths; subjects I already had enough exposure to, since I was learning them since my school days. But education is built upon trust so I believed that whoever has made this curriculum must know that it is useful in someway in the future.</p>\n<p>I was very eager to get into the second year of the college as I was very eager to learn the 4-5 topics that I<br>\nmentioned earlier. I completed the first year with a bang.</p>\n<p>Then comes the second year of college or the second half of my college life. I asked my friend to send me the time-table, so that I could have a look at the subjects that will be taught in the semester. He sent me a picture of the time table, I was delighted to finally see a bunch of computer science related subjects. That time table brought smile on my face! And I got back to the University as soon as I could because I did not want to miss any of the action related to computers from your faculty. The course started, after the first month or so I realized that Computer Science Engineering was missing Computer, Science and Engineering. Your Ph. D. faculty knew nothing about computers.<br>\nWhat they were teaching was something that I already knew when I was in 10th standard. I came to know that I am stuck. I was demotivated, I was sad about the fact that I trusted your faculty, I had established a strong relationship with your university in the meantime, and I was possessive about it, and it was all in vain in just a month. I realized the fact that I have to do everything on my own as teachers in my college did not even know how to write a simple basic program. I went to my hostel room and started studying everything by myself. This continued for some days. When I would ask your teachers for help they would ignore me, because of the fact that they did not know how to do it, I was even much more demotivated by this. I realized if teachers don't teach something useful and that too in the worst possible way and on top of that they don't even help me then why am I going to classes? I decided not to attend classes, as I was wasting my time and my family's money by just sitting there without any productivity.</p>\n<p>4 months later today, I am detained in all the subjects and I am restricted to appear in any of the examination. I am happy, like I was happy to see the time table in the starting. I am happy because I could study whatever I want to, and I am not cramming a piece of paper day and night, rather than that I am working on projects, that really matter to me. I am learning how to build things, I am learning to make things efficiently. I am learning what really matters to me. I am not learning for a piece of paper, that I will get after 4 years of frustration, or some people call it graduation. I am learning for education, to make myself skilled, to make myself employable, or even in the worst case scenario if I don't get employed somewhere I can do something of my own. I don't want to be dependent. I want to be on my own. When I told teachers that I am dropping out they would argue that even in IITs it is the same case, they teach the same syllabus that we do. Well IITs have well qualified staff and when they teach they attract students. I have enrolled in many courses offered by IITs and I have seen the difference between IIT and JECRC. Please don't compare<br>\nIIT with this university yet.</p>\n<p>But yes education in Computer Science is not upto the mark in most of the colleges in India.</p>\n<p>Whom to blame? Syllabus? Can't blame it, as JECRC University is autonomous institute, they have right to set their own syllabus. Now whom to blame? I would blame the unwilling behaviour of the college authority and the norms set by UGC and past HRD ministries. In education you have to think about things that are coming up in the future, you have to teach the students about the uncertain future. But ironically the syllabus is almost 40 years old now, which is totally irrelevant in modern context, and in your microsoft labs the technology used in the labs is at least 20 years old. Students don't know how to use a basic framework, how will they make a software? Leave that, students don't even know how to output &quot;Hello world!&quot; on the screen.</p>\n<p>It would be very sick of me if I would just criticize the way you are working. So here are some problems that I faced and some suggestions that could be implemented for the problems. I am just talking about Computer Science Branch.</p>\n<ul>\n<li>Motivate your students.</li>\n<li>Even though your university is brand new but you need to update the technologies that are being used in the college.<br>\nIt's high time that we move onto the newer things like Javascript or Python. Or if you want to stick to C++ then please update the version to C++ 11. The C++ we are working on in our labs is a version made in 1990s and hardly any open source software use it.</li>\n<li>Teach how to use external libraries and frameworks. Nobody likes to write 1000 lines of code when you can do it in 10-15 lines using an external library or framework.</li>\n<li>Teach students how to implement things in classes using a computer attached to a projector, and let students work on projects in labs based on what you taught in class.</li>\n<li>Make course website for all the courses that are being offered in the university. Like this one <a href=\"http://web.stanford.edu/class/cs106b/\">http://web.stanford.edu/class/cs106b/</a></li>\n<li>Use online forums for class discussion like Piazza.</li>\n<li>Assignments must be productive, it should not be about filling copy pages. It should be about practically working on something.</li>\n<li>Scrap final exams. Instead ask students to work on projects and asses their grade based on how well they did in the final project.</li>\n<li>Teach how to use tools like Git and Github, testing frameworks and IDE in software engineering, it is not a theoretical subject. Same goes for other subjects. Teach skills.</li>\n<li>Make big lecture halls, lecture halls that could accommodate 600 people. There is no point of hiring 6-7 different unskilled teachers to teach the same thing, rather than that, hire just one teacher in a subject who knows the subject to the absolute core and who know how to teach.</li>\n<li>Make attendance non-compulsory until and unless you have good teachers, students are scared of authority but I ain't, so let me tell you, they always criticize you for this.</li>\n<li>Classes are for sharing knowledge, it is not for dictating notes. 60-70% of the time in most of the classes is spent only on dictating notes and filling copies. I never believed in writing notes and I used to practice this since I was in school. I never wrote notes until I was forced to or I felt that it is something useful. Students here pay enough tuition fee that you could provide us with handouts for the lecture. Or even a .pdf file will work out pretty well. In the time you get during the lecture, implement programs or do things practically and let students see the beauty of computers.</li>\n<li>Appoint TAs (teacher assistant) from the students who already had studied the subject and did it with excellency. I would love to be a TA for OOPs and Intro to C Programming and Data Structure and Algorithms.</li>\n<li>Never argue that Indian Universities do not work like the way I want it to be. Indian community is based on many old beliefs that we need to overcome now, in order to develop wholly.</li>\n<li>I don't know why some of your teachers have so much egoistic problems. They just can't get the fact that they are wrong.</li>\n</ul>\n<ol>\n<li>A teacher put a semicolon just after <code>void main()</code> and when told by the students that it is wrong she argued that it is right for 15 minutes on this.</li>\n<li>Another teacher argued that he does not refer Indian authors when he was proved wrong by an Indian author's book and let me tell you the book was right!</li>\n<li>A teacher got troubled during practical examination when a student's code was working when he was using variable names as <code>x</code> and <code>y</code> instead of <code>i</code> and <code>j</code>. And she asked him, how the code is working when he is not using <code>i</code> and <code>j</code> and the student instead of arguing and wasting time, changed the variable's name to <code>i</code> and <code>j</code>.</li>\n</ol>\n<blockquote>\n<p>So make sensible decision before hiring a teacher, remember that teachers build future and we don't care whether they are XII pass-out or IIT pass-out until and unless they teach well.</p>\n</blockquote>\n<ul>\n<li>Let students strive for education and not for a degree. Degree should be the last thing that should come to someone's mind.</li>\n<li>Educate students about what they are learning how it is applicable in the real world. Nobody wants to learn something of no use.</li>\n<li>Join Skill India Movement and use your asset, the students, that you have and do something productive, skills is what separates an engineer and a clerk. Students are creative, and they are the new you. They hold the capability of inspiring whole nation but they can't do it without skills.</li>\n<li>Stop snatching students parents' money, if a router get stolen in a hostel don't just simply impose 200rs. fine on every student and grab 35, 000rs. for a 1, 200rs. router. Instead install surveillance cameras and hire watchman for every floor and claim them responsible. We are not your watchmen that we will take care of your routers.</li>\n<li>Internet is very important nowadays. It has good as well as bad aspect but look at the bright side and provide good internet services in the hostels. At least 2 MBPS should be the internet speed. Charge 5000rs more but do this with immediate effect. I have a video conference coming up and I have internet with a speed of 50 KBPS in which I will do 'babaji ka thullu'. (Update : Because of the high speed internet (50KBPS) I could not attend the conference)</li>\n<li>Instead of giving classes for MBA it would be much more sensible to tie up with an institute that would teach Computer<br>\nScience and its fundamentals. They already have great hand-picked teachers with them.</li>\n<li>Stop scaring students that they won't be allowed to sit in placement session if they don't do this or that.</li>\n<li>Support me if I join politics.</li>\n</ul>\n<p>I have vested interest in education, as a matter of fact I come from a family who has a school of their own. I am against this education system since I got into high school. Why study Physics, Chemistry, Maths for the entrance test when all you have to do is study Computer Science Engineering in a college and you know it is your 'kick', I am not saying that these subjects are not important but except maths nothing is important in Computer Science Engineering.<br>\nWhy not rank students based on interest in particular field when they appear for a particular college? Why not someone who always wanted to learn how machine works not taught how machine works during school, why when I loved computers in school I was forced to study chemistry? By doing this education system is killing the creative capability that we posses.</p>\n<p>Skills are much more important than a degree. Education is about education, it is not about a degree.</p>\n<p>Why not you initiate the change? You hold a prominent position in Indian society, why not you take good decisions for the betterment of the community as well as the students you are serving? Why Prime Minister Narendra Modi is running skill India movement and why we are allotting degrees in an unskilled manner and ensuring that the students don't get good jobs?</p>\n<blockquote>\n<p>&quot;Be the change that you wish to see in the world.&quot;</p>\n<p><em>― Mahatma Gandhi</em></p>\n</blockquote>\n<p>I am the change, are you?</p>\n<p>Thanks,</p>\n<p>Rhitik</p>\n<hr>\n<p>Update <code>Sep-06-2020</code>: Reposting this piece which I wrote and published on facebook pages around 4 years ago, it got quite decent traction back then. I got emails, facebook messages, friend requests, follows, likes from random folks across the country, and they wished me all the very best, that showed me the good and powerful side of the internet. 🙂</p>\n<p>I will push out an update on how I am doing, what were some of the things that I learned along the way, and most importantly was it a success or a failure?</p>\n<p><a href=\"/mailing-list\">Make sure you are subscribed to my mailing list</a>!</p>\n",
      "date_published": "2016-06-07T00:00:00+00:00"
    }
  ]
}
